InformationRegisters/ПодключениеКомбинированныхПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПодключениеКомбинированныхПриложений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусКомбинированногоПриложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусКомбинированногоПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусКомбинированногоПриложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрированоОбновление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрированоУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользовалось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ТарификацияБизнес/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// см. ТарификацияПереопределяемый.ПриФормированииСпискаУслуг
//
Процедура ПриФормированииСпискаУслуг(ПоставщикиУслуг) Экспорт
	
	Возврат;
	
КонецПроцедуры

// см. ТарификацияПереопределяемый.ПриИзмененииСостоянияАктивацииЛицензии
//
Процедура ПриИзмененииСостоянияАктивацииЛицензии(ДанныеОЛицензии, ЛицензияАктивирована) Экспорт
	
	Возврат;
	
КонецПроцедуры

// см. ТарификацияПереопределяемый.ПриОбновленииДоступныхЛицензий
//
Процедура ПриОбновленииДоступныхЛицензий(ПараметрыЛицензии) Экспорт
	
	ИмяТекущегоВидаПриложения = ВидыПриложенийСервер.ИмяТекущегоВидаПриложения();
	
	Если ИмяТекущегоВидаПриложения = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяТекущегоВидаПриложения <> "Бизнес" Тогда
		Возврат;
	КонецЕсли;
	
	ОбновленнаяУслуга = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЛицензии.Услуга, "Идентификатор");
	СписокПриложений = ПриложенияПоИдентификаторамУслуг(ОбновленнаяУслуга);
	Если СписокПриложений.Количество() = 0 Тогда
		// Услуга, которая не является составляющей комбинированного приложения, ничего делать не требуется.
		Возврат;
	КонецЕсли;
	
	ОписаниеНовогоПриложения = СписокПриложений[0];

	// Проверяем - если приложение уже подключено, то повторное подключение не выполняем	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодключениеКомбинированныхПриложенийСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ПодключениеКомбинированныхПриложений.СрезПоследних(, 
		|				ИмяПриложения = &ИмяПриложения) КАК ПодключениеКомбинированныхПриложенийСрезПоследних";
	
	Запрос.УстановитьПараметр("ИмяПриложения", ОписаниеНовогоПриложения.Имя);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда     
		// Если приложение уже подключено, тогда ничего не делаем
		Если ВыборкаДетальныеЗаписи.Статус = Перечисления.СтатусКомбинированногоПриложения.Подключено Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	ВключитьРегламентноеЗаданиеАктуализацияСостоянийПодключенныхПодписок();
	
	ОписаниеСобытия = НСтр("ru='Обновление доступной лицензии: ""%1""; Номер подписки:""%2""; Приложение: ""%3"".'");
	ОписаниеСобытия = СтрШаблон(ОписаниеСобытия, ОбновленнаяУслуга, ПараметрыЛицензии.НомерПодписки, ОписаниеНовогоПриложения.Имя);              
	ЗаписьЖурналаРегистрации(ИмяЖР(), УровеньЖурналаРегистрации.Информация,,, ОписаниеСобытия);
	
	ПроверятьЛицензии = Истина;
	ОтправлятьОповещение = Истина;
	ОбработатьПодключениеПриложения(ОписаниеНовогоПриложения, ОписаниеСобытия, ПроверятьЛицензии, ОтправлятьОповещение);
	
КонецПроцедуры

// см. ТарификацияПереопределяемый.ПриУдаленииДоступныхЛицензий
//
Процедура ПриУдаленииДоступныхЛицензий(ПараметрыЛицензии) Экспорт
	
	ИмяТекущегоВидаПриложения = ВидыПриложенийСервер.ИмяТекущегоВидаПриложения();
	
	Если ИмяТекущегоВидаПриложения = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяТекущегоВидаПриложения <> "Бизнес" Тогда
		Возврат;
	КонецЕсли;
	
	ОтключаемаяУслуга = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЛицензии.Услуга, "Идентификатор");
	СписокПриложений = ПриложенияПоИдентификаторамУслуг(ОтключаемаяУслуга);
	Если СписокПриложений.Количество() = 0 Тогда
		// Услуга, которая не является составляющей комбинированного приложения, ничего делать не требуется.
		Возврат;
	КонецЕсли;
	
	ОписаниеОтключаемогоПриложения = СписокПриложений[0];
	ИдентификаторПоставщика = ТарификацияУНФ.ИдентификаторПоставщикаУНФ();
	Если ЗарегистрированаАльтернативнаяЛицензияБезлимитнойУслуги(ИдентификаторПоставщика, 
								ОтключаемаяУслуга, ПараметрыЛицензии.НомерПодписки) = Истина Тогда
		Возврат;
	КонецЕсли;

	ОписаниеСобытия = НСтр("ru='Удаление доступной лицензии: ""%1""; Номер подписки:""%2""; Приложение: ""%3"".'");
	ОписаниеСобытия = СтрШаблон(ОписаниеСобытия, ОтключаемаяУслуга, ПараметрыЛицензии.НомерПодписки, ОписаниеОтключаемогоПриложения.Имя);
	ЗаписьЖурналаРегистрации(ИмяЖР(), УровеньЖурналаРегистрации.Информация,,, ОписаниеСобытия);
	
	ПроверятьЛицензии = Истина;
	ОтправлятьОповещение = Истина;
	ОбработатьОтключениеПриложения(
	ОписаниеОтключаемогоПриложения, ОписаниеСобытия, ПроверятьЛицензии, ОтправлятьОповещение);
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииСерверныхОповещений
//
Процедура ПриДобавленииСерверныхОповещений(Оповещения) Экспорт
	
	Оповещение = СерверныеОповещения.НовоеСерверноеОповещение(ТарификацияБизнесКлиентСервер.ИмяСерверногоОповещения());
	Оповещение.ИмяМодуляПолучения = "ТарификацияБизнесКлиент";
	Оповещения.Вставить(Оповещение.Имя, Оповещение);
	
КонецПроцедуры

#КонецОбласти

Функция СписокУслуг() Экспорт
	
	Услуги = Новый Массив;
	
	// Мини-приложения
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиПриложениеВыставлениеСчетов());
	Услуга.Вставить("Наименование", ИдентификаторУслугиПриложениеВыставлениеСчетов());
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Лимитированная);
	Услуги.Добавить(Услуга);
	
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиПриложениеПоискИПроверкаКонтрагентов());
	Услуга.Вставить("Наименование", ИдентификаторУслугиПриложениеПоискИПроверкаКонтрагентов());
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Лимитированная);
	Услуги.Добавить(Услуга);
	
	// Приложения
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиПриложениеCRM());
	Услуга.Вставить("Наименование", ИдентификаторУслугиПриложениеCRM());
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Лимитированная);
	Услуги.Добавить(Услуга);
	
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиПриложениеОнлайнПродажи());
	Услуга.Вставить("Наименование", ИдентификаторУслугиПриложениеОнлайнПродажи());
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Лимитированная);
	Услуги.Добавить(Услуга);
	
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиПриложениеОптовыеПродажи());
	Услуга.Вставить("Наименование", ИдентификаторУслугиПриложениеОптовыеПродажи());
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Лимитированная);
	Услуги.Добавить(Услуга);
	
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиПриложениеПроизводство());
	Услуга.Вставить("Наименование", ИдентификаторУслугиПриложениеПроизводство());
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Лимитированная);
	Услуги.Добавить(Услуга);
	
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиПриложениеРозничныеПродажи());
	Услуга.Вставить("Наименование", ИдентификаторУслугиПриложениеРозничныеПродажи());
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Лимитированная);
	Услуги.Добавить(Услуга);
	
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиПриложениеУслуги());
	Услуга.Вставить("Наименование", ИдентификаторУслугиПриложениеУслуги());
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Лимитированная);
	Услуги.Добавить(Услуга);
	
	Услуга = Новый Структура;
	Услуга.Вставить("Идентификатор", ИдентификаторУслугиПриложениеБухгалтерия());
	Услуга.Вставить("Наименование", ИдентификаторУслугиПриложениеБухгалтерия());
	Услуга.Вставить("ТипУслуги", Перечисления.ТипыУслуг.Лимитированная);
	Услуги.Добавить(Услуга);
	
	Возврат Услуги;
	
КонецФункции

Функция ДоступныеПриложения(ПроверятьЛицензии, ТолькоБизнесПриложения = Ложь) Экспорт
	
	ВыбратьСПроверкойЛицензий =
	ПроверятьЛицензии
	И ОбщегоНазначения.РазделениеВключено()
	И Константы.РежимИспользованияИнформационнойБазы.Получить() <>
	Перечисления.РежимыИспользованияИнформационнойБазы.Демонстрационный;
	
	Если ВыбратьСПроверкойЛицензий Тогда
		ПодключенныеУслуги = ПодключенныеУслугиПриложений();
		ОписаниеДоступныхПриложений = ПриложенияПоИдентификаторамУслуг(ПодключенныеУслуги);
	Иначе
		ОписаниеДоступныхПриложений = РегистрыСведений.ПодключениеКомбинированныхПриложений.ПодключенныеПриложения();
	КонецЕсли;
	
	Если НЕ ТолькоБизнесПриложения Тогда
		Возврат ОписаниеДоступныхПриложений;
	КонецЕсли;
	
	ОписаниеДоступныхБизнесПриложений = Новый Массив;
	
	Для Каждого Приложение Из ОписаниеДоступныхПриложений Цикл
			
		Если Приложение.ЭтоБизнесПриложение Тогда
			ОписаниеДоступныхБизнесПриложений.Добавить(Приложение);
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат ОписаниеДоступныхБизнесПриложений;
	
КонецФункции

Функция НоваяТаблицаВозможностей() Экспорт
	
	ТипыЗначений = Новый Массив;
	ТипыЗначений.Добавить(Тип("Булево"));
	ТипыЗначений.Добавить(Тип("Число"));
	ТипыЗначений.Добавить(Тип("ПеречислениеСсылка.ВидыКонтроляДоговоровПриПроведении"));
	ТипыЗначений.Добавить(Тип("ПеречислениеСсылка.КодыНоменклатурыВДокументах"));
	ТипыЗначений.Добавить(Тип("ПеречислениеСсылка.СпособОтображенияСкидок"));
	ТипыЗначений.Добавить(Тип("ПеречислениеСсылка.ВариантыВыводаСуммыБезСкидки"));
	ТипыЗначений.Добавить(Тип("ПеречислениеСсылка.КонтактнаяИнформацияТоварногоЧека"));
	ТипыЗначений.Добавить(Тип("ПеречислениеСсылка.ПечатьПользовательскихЕдиницИзмерения"));
	ТипыЗначений.Добавить(Тип("ПеречислениеСсылка.ВариантыПечатиДоставки"));
	ТипыЗначений.Добавить(Тип("ПеречислениеСсылка.ДаНет"));
	ТипыЗначений.Добавить(Тип("ПеречислениеСсылка.ВидыНаименованийДляПечатиДокументов"));
	
	ТаблицаВозможностей = Новый ТаблицаЗначений;
	ТаблицаВозможностей.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	
	ТаблицаВозможностей.Колонки.Добавить("ЗначениеПоУмолчанию", Новый ОписаниеТипов(ТипыЗначений));
	
	Возврат ТаблицаВозможностей;
	
КонецФункции

Функция ДобавитьВозможностьВПриложение(ТаблицаВозможностей, ИмяВозможности, ЗначениеПоУмолчанию) Экспорт
	НоваяВозможность = ТаблицаВозможностей.Добавить();
	НоваяВозможность.Имя = ИмяВозможности;
	НоваяВозможность.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяЖР() Экспорт
	
	Возврат НСтр("ru='ТарификацияБизнес'", ОбщегоНазначения.КодОсновногоЯзыка())
	
КонецФункции

Функция ОписаниеВсехПриложений() Экспорт
	
	ДоступныеПриложения = Новый Массив;
	
	// Мини-приложения
	
	ОписаниеПриложения = НовыйОписаниеПриложения();
	ОписаниеПриложения.Имя = "ВыставлениеСчетов";
	ОписаниеПриложения.Синоним = НСтр("ru='Выставление счетов'");
	ОписаниеПриложения.ИдентификаторУслугиСервиса = ИдентификаторУслугиПриложениеВыставлениеСчетов();
	ОписаниеПриложения.МодульПриложения = "БизнесПриложениеВыставлениеСчетов";
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ПоискИПроверкаКонтрагентов"); 
	ОписаниеПриложения.ЭтоБизнесПриложение = Истина;
	ДоступныеПриложения.Добавить(ОписаниеПриложения);
	
	ОписаниеПриложения = НовыйОписаниеПриложения();
	ОписаниеПриложения.Имя = "ПоискИПроверкаКонтрагентов";
	ОписаниеПриложения.Синоним = НСтр("ru='Проверка контрагентов'");
	ОписаниеПриложения.ИдентификаторУслугиСервиса = ИдентификаторУслугиПриложениеПоискИПроверкаКонтрагентов();
	ОписаниеПриложения.МодульПриложения = "БизнесПриложениеПоискИПроверкаКонтрагентов";
	ОписаниеПриложения.ЭтоБизнесПриложение = Истина;
	ДоступныеПриложения.Добавить(ОписаниеПриложения);
	
	// Приложения
	
	ОписаниеПриложения = НовыйОписаниеПриложения();
	ОписаниеПриложения.Имя = "CRM";
	ОписаниеПриложения.Синоним = НСтр("ru='CRM'");
	ОписаниеПриложения.ИдентификаторУслугиСервиса = ИдентификаторУслугиПриложениеCRM();
	ОписаниеПриложения.МодульПриложения = "БизнесПриложениеCRM";
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ПоискИПроверкаКонтрагентов");
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ВыставлениеСчетов");
	ОписаниеПриложения.СовместныеПриложения.Добавить("Бухгалтерия");
	ОписаниеПриложения.ЭтоБизнесПриложение = Истина;
	ДоступныеПриложения.Добавить(ОписаниеПриложения);
	
	ОписаниеПриложения = НовыйОписаниеПриложения();
	ОписаниеПриложения.Имя = "ОнлайнПродажи";
	ОписаниеПриложения.Синоним = НСтр("ru='Онлайн-продажи'");
	ОписаниеПриложения.ИдентификаторУслугиСервиса = ИдентификаторУслугиПриложениеОнлайнПродажи();
	ОписаниеПриложения.МодульПриложения = "БизнесПриложениеОнлайнПродажи";
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ПоискИПроверкаКонтрагентов");
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ВыставлениеСчетов");
	ОписаниеПриложения.СовместныеПриложения.Добавить("Бухгалтерия");
	ОписаниеПриложения.ЭтоБизнесПриложение = Истина;
	ДоступныеПриложения.Добавить(ОписаниеПриложения);
	
	ОписаниеПриложения = НовыйОписаниеПриложения();
	ОписаниеПриложения.Имя = "ОптовыеПродажи";
	ОписаниеПриложения.Синоним = НСтр("ru='Оптовые продажи'");
	ОписаниеПриложения.ИдентификаторУслугиСервиса = ИдентификаторУслугиПриложениеОптовыеПродажи();
	ОписаниеПриложения.МодульПриложения = "БизнесПриложениеОптовыеПродажи";
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ПоискИПроверкаКонтрагентов");
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ВыставлениеСчетов");
	ОписаниеПриложения.СовместныеПриложения.Добавить("Бухгалтерия");
	ОписаниеПриложения.ЭтоБизнесПриложение = Истина;
	ДоступныеПриложения.Добавить(ОписаниеПриложения);
	
	ОписаниеПриложения = НовыйОписаниеПриложения();
	ОписаниеПриложения.Имя = "Производство";
	ОписаниеПриложения.Синоним = НСтр("ru='Производство'");
	ОписаниеПриложения.ИдентификаторУслугиСервиса = ИдентификаторУслугиПриложениеПроизводство();
	ОписаниеПриложения.МодульПриложения = "БизнесПриложениеПроизводство";
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ПоискИПроверкаКонтрагентов");
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ВыставлениеСчетов");
	ОписаниеПриложения.СовместныеПриложения.Добавить("Бухгалтерия");
	ОписаниеПриложения.ЭтоБизнесПриложение = Истина;
	ДоступныеПриложения.Добавить(ОписаниеПриложения);
	
	ОписаниеПриложения = НовыйОписаниеПриложения();
	ОписаниеПриложения.Имя = "РозничныеПродажи";
	ОписаниеПриложения.Синоним = НСтр("ru='Розница'");
	ОписаниеПриложения.ИдентификаторУслугиСервиса = ИдентификаторУслугиПриложениеРозничныеПродажи();
	ОписаниеПриложения.МодульПриложения = "БизнесПриложениеРозничныеПродажи";
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ПоискИПроверкаКонтрагентов");
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ВыставлениеСчетов");
	ОписаниеПриложения.СовместныеПриложения.Добавить("Бухгалтерия");
	ОписаниеПриложения.ЭтоБизнесПриложение = Истина;
	ДоступныеПриложения.Добавить(ОписаниеПриложения);
	
	ОписаниеПриложения = НовыйОписаниеПриложения();
	ОписаниеПриложения.Имя = "Услуги";
	ОписаниеПриложения.Синоним = НСтр("ru='Услуги'");
	ОписаниеПриложения.ИдентификаторУслугиСервиса = ИдентификаторУслугиПриложениеУслуги();
	ОписаниеПриложения.МодульПриложения = "БизнесПриложениеУслуги";
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ПоискИПроверкаКонтрагентов");
	ОписаниеПриложения.ЗамещаетПриложения.Добавить("ВыставлениеСчетов");
	ОписаниеПриложения.СовместныеПриложения.Добавить("Бухгалтерия");
	ОписаниеПриложения.ЭтоБизнесПриложение = Истина;
	ДоступныеПриложения.Добавить(ОписаниеПриложения);
	
	ОписаниеПриложения = НовыйОписаниеПриложения();
	ОписаниеПриложения.Имя = "Бухгалтерия";
	ОписаниеПриложения.Синоним = НСтр("ru='Бухгалтерия'");
	ОписаниеПриложения.ИдентификаторУслугиСервиса = ИдентификаторУслугиПриложениеБухгалтерия();
	ОписаниеПриложения.МодульПриложения = "БизнесПриложениеБухгалтерия";
	ДоступныеПриложения.Добавить(ОписаниеПриложения);
	
	Возврат ДоступныеПриложения;
	
КонецФункции

Процедура ОбработатьПодключениеПриложения(
	ОписаниеНовогоПриложения, ПричинаПодключения, ПроверятьЛицензии, ОтправлятьОповещение = Ложь) Экспорт
	
	ОписаниеДоступныхПриложений = ДоступныеПриложения(ПроверятьЛицензии, Истина);
	ОписаниеДоступныхПриложений = УдалитьПриложениеИзСписка(ОписаниеДоступныхПриложений, ОписаниеНовогоПриложения.Имя);

	ПодключенноеПриложениеАктуально = Истина;   
	Если ПроверятьЛицензии = Истина Тогда
		ПодключенноеПриложениеАктуально = Тарификация.ЗарегистрированаЛицензияБезлимитнойУслуги(
												ТарификацияУНФ.ИдентификаторПоставщикаУНФ(), ОписаниеНовогоПриложения.ИдентификаторУслугиСервиса);
	КонецЕсли;
	
	ПриложенияДляОтключения = Новый Массив;
	ПриложенияДляПодключения = Новый Массив;
	
	ЗамещаемыеПриложенияПодключаемогоПриложения = ОписаниеНовогоПриложения.ЗамещаетПриложения;
	ОписаниеЗамещаемыхПриложений = ОписаниеВыбранныхПриложений(ОписаниеДоступныхПриложений, ЗамещаемыеПриложенияПодключаемогоПриложения);
	СовместныеПриложенияПодключаемогоПриложения = ОписаниеНовогоПриложения.СовместныеПриложения;
	ОписаниеСовместныхПриложений = ОписаниеВыбранныхПриложений(ОписаниеДоступныхПриложений, СовместныеПриложенияПодключаемогоПриложения);
	
	КоличествоДоступныхПриложений = ОписаниеДоступныхПриложений.Количество() - ОписаниеСовместныхПриложений.Количество();
	ЭтоЗамещениеПриложения = ОписаниеЗамещаемыхПриложений.Количество() >= КоличествоДоступныхПриложений;
	
	ЗамещаемыеПриложенияПодключенныхПриложений = ЗамещаемыеПриложенияПодключенныхПриложений(ОписаниеДоступныхПриложений);
	ПодключаетсяЗамещаемоеПриложение = ЗамещаемыеПриложенияПодключенныхПриложений.Найти(ОписаниеНовогоПриложения.Имя) <> Неопределено;
	
	Если ЭтоЗамещениеПриложения И ПодключенноеПриложениеАктуально = Истина Тогда   
		ПриложенияДляОтключения = ОписаниеЗамещаемыхПриложений;
		РабочийСтолУНФ.ОчиститьРабочийСтол();
		РабочийСтолУНФ.ОчиститьНастройкиСоставаИнтерфейса();
	КонецЕсли;
	
	Если НЕ ПодключаетсяЗамещаемоеПриложение И ПодключенноеПриложениеАктуально = Истина Тогда       
		ПриложенияДляПодключения.Добавить(ОписаниеНовогоПриложения);
	КонецЕсли;
	
	ДоступныеВозможностиПриложений = ДоступныеВозможностиПриложений(ОписаниеДоступныхПриложений, ЗамещаемыеПриложенияПодключаемогоПриложения);
	ОтключитьПриложения(ПриложенияДляОтключения, ПричинаПодключения, ДоступныеВозможностиПриложений);
	ПодключитьПриложения(ПриложенияДляПодключения, ПричинаПодключения);
	
	Если ОтправлятьОповещение И НЕ ПодключаетсяЗамещаемоеПриложение Тогда
		ОповеститьОПодключенномПриложении(ОписаниеНовогоПриложения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьОтключениеПриложения(
	ОписаниеОтключаемогоПриложения, ПричинаОтключения, ПроверятьЛицензии, ОтправлятьОповещение = Ложь) Экспорт
	
	ПриложенияДляОтключения = Новый Массив;
	ПриложенияДляПодключения = Новый Массив;
	
	ОписаниеДоступныхПриложений = ДоступныеПриложения(ПроверятьЛицензии, Истина);      
	ОписаниеДоступныхПриложений = УдалитьПриложениеИзСписка(ОписаниеДоступныхПриложений, ОписаниеОтключаемогоПриложения.Имя);
	
	ЗамещаемыеПриложенияОтключаемогоПриложения = ОписаниеОтключаемогоПриложения.ЗамещаетПриложения;
	ОписаниеЗамещаемыхПриложений = ОписаниеВыбранныхПриложений(ОписаниеДоступныхПриложений, ЗамещаемыеПриложенияОтключаемогоПриложения);
	СовместныеПриложенияОтключаемогоПриложения = ОписаниеОтключаемогоПриложения.СовместныеПриложения;
	ОписаниеСовместныхПриложений = ОписаниеВыбранныхПриложений(ОписаниеДоступныхПриложений, СовместныеПриложенияОтключаемогоПриложения);
	
	КоличествоДоступныхПриложений = ОписаниеДоступныхПриложений.Количество() - ОписаниеСовместныхПриложений.Количество();
	ЭтоЗамещениеПриложения = ОписаниеЗамещаемыхПриложений.Количество() >= КоличествоДоступныхПриложений;
	
	Если ЭтоЗамещениеПриложения Тогда
		ПриложенияДляОтключения = ОписаниеСовместныхПриложений;
		РабочийСтолУНФ.ОчиститьРабочийСтол();
		РабочийСтолУНФ.ОчиститьНастройкиСоставаИнтерфейса();
	КонецЕсли;
	
	ПриложенияДляОтключения.Добавить(ОписаниеОтключаемогоПриложения);
	
	ДоступныеВозможностиПриложений = ДоступныеВозможностиПриложений(ОписаниеДоступныхПриложений);
	ОтключитьПриложения(ПриложенияДляОтключения, ПричинаОтключения, ДоступныеВозможностиПриложений);
	
	//новое подключение
	Если ЭтоЗамещениеПриложения Тогда
		ПолучитьВерхнеуровневоеПриложение(ОписаниеЗамещаемыхПриложений);      
		ПодключитьПриложения(ОписаниеЗамещаемыхПриложений, ПричинаОтключения);
	КонецЕсли;
	
	Если ОтправлятьОповещение И Не ЭтоПриложениеЗамещено(ОписаниеОтключаемогоПриложения) Тогда
		ОповеститьОбОтключенномПриложении(ОписаниеОтключаемогоПриложения);
	КонецЕсли;
	
КонецПроцедуры

Функция ПриложениеМожетБытьПодключено(ОписаниеПриложения) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Результат", Истина);
	Результат.Вставить("Причина", "");
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		Если ВозможностиПриложения.ЭтоБизнесПриложение() Тогда
			Возврат Результат;
		Иначе
			Результат.Результат = Ложь;
			Результат.Причина = НСтр("ru='Приложение может быть подключено только в режиме запуска комбинированного приложения.'");
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	ЗарегистрированаЛицензия = Тарификация.ЗарегистрированаЛицензияБезлимитнойУслуги(
		ТарификацияУНФ.ИдентификаторПоставщикаУНФ(), ОписаниеПриложения.ИдентификаторУслугиСервиса);
	
	Если Не ЗарегистрированаЛицензия Тогда
		Результат.Результат = Ложь;
		Результат.Причина = НСтр("ru='Не подключена услуга ""%1"".'");
		Результат.Причина = СтрШаблон(Результат.Причина, ОписаниеПриложения.ИдентификаторУслугиСервиса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИдентификаторыУслугПриложений

Функция ИдентификаторУслугиПриложениеВыставлениеСчетов()
	Возврат "Бизнес:ВыставлениеСчетов";
КонецФункции

Функция ИдентификаторУслугиПриложениеПоискИПроверкаКонтрагентов()
	Возврат "Бизнес:ПоискИПроверкаКонтрагентов";
КонецФункции

Функция ИдентификаторУслугиПриложениеCRM()
	Возврат "Бизнес:CRM";
КонецФункции

Функция ИдентификаторУслугиПриложениеОнлайнПродажи()
	Возврат "Бизнес:ОнлайнПродажи";
КонецФункции

Функция ИдентификаторУслугиПриложениеОптовыеПродажи()
	Возврат "Бизнес:ОптовыеПродажи";
КонецФункции

Функция ИдентификаторУслугиПриложениеПроизводство()
	Возврат "Бизнес:Производство";
КонецФункции

Функция ИдентификаторУслугиПриложениеРозничныеПродажи()
	Возврат "Бизнес:РозничныеПродажи";
КонецФункции

Функция ИдентификаторУслугиПриложениеУслуги()
	Возврат "Бизнес:Услуги";
КонецФункции

Функция ИдентификаторУслугиПриложениеБухгалтерия()
	Возврат "Бизнес:Бухгалтерия";
КонецФункции

#КонецОбласти

#Область ПодключениеОтключениеПриложений

Процедура ПодключитьПриложения(СписокПриложений, ОписаниеПричины)
	
	Если СписокПриложений.Количество() = 0 Тогда
		Комментарий = НСтр("ru='Подключение приложений не выполнялось, передан пустой список приложений.'");
		ЗаписьЖурналаРегистрации(ИмяЖР(), УровеньЖурналаРегистрации.Информация,,, Комментарий);
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого ОписаниеПриложения Из СписокПриложений Цикл
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			Блокировка.Добавить("РегистрСведений.ПодключениеКомбинированныхПриложений");
			Блокировка.Заблокировать();
			
			МодульПриложения = ОбщегоНазначения.ОбщийМодуль(ОписаниеПриложения.МодульПриложения);
			МодульПриложения.ВключитьВозможностиПриложения();
			
			ОписаниеСобытия = НСтр("ru='Подключено приложение: %1'");
			ОписаниеСобытия = СтрШаблон(ОписаниеСобытия, ОписаниеПриложения.Имя);
			
			РегистрыСведений.ПодключениеКомбинированныхПриложений.ЗарегистрироватьСобытие(ОписаниеПриложения.Имя, Перечисления.СтатусКомбинированногоПриложения.Подключено, ОписаниеПричины);
			ЗаписьЖурналаРегистрации(ИмяЖР(), УровеньЖурналаРегистрации.Информация,,, ОписаниеСобытия);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Комментарий = НСтр("ru='Ошибка при попытке подключить приложение ""%1"" по причине:
			|%2.'");
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			Комментарий = СтрШаблон(Комментарий, ОписаниеПриложения.Имя, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтключитьПриложения(СписокПриложений, ОписаниеПричины, ДоступныеВозможностиПриложений)
	
	Если СписокПриложений.Количество() = 0 Тогда
		Комментарий = НСтр("ru='Отключение приложений не выполнялось, передан пустой список приложений.'");
		ЗаписьЖурналаРегистрации(ИмяЖР(), УровеньЖурналаРегистрации.Информация,,, Комментарий);
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого ОписаниеПриложения Из СписокПриложений Цикл
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			Блокировка.Добавить("РегистрСведений.ПодключениеКомбинированныхПриложений");
			Блокировка.Заблокировать();
			
			МодульПриложения = ОбщегоНазначения.ОбщийМодуль(ОписаниеПриложения.МодульПриложения);
			МодульПриложения.ОтключитьВозможностиПриложения(ДоступныеВозможностиПриложений);
			
			ОписаниеСобытия = НСтр("ru='Отключено приложение: %1'");
			ОписаниеСобытия = СтрШаблон(ОписаниеСобытия, ОписаниеПриложения.Имя);
			
			РегистрыСведений.ПодключениеКомбинированныхПриложений.ЗарегистрироватьСобытие(ОписаниеПриложения.Имя, Перечисления.СтатусКомбинированногоПриложения.Отключено, ОписаниеПричины);
			ЗаписьЖурналаРегистрации(ИмяЖР(), УровеньЖурналаРегистрации.Информация,,, ОписаниеСобытия);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Комментарий = НСтр("ru='Ошибка при попытке отключить приложение ""%1"" по причине:
			|%2.'");
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			Комментарий = СтрШаблон(Комментарий, ОписаниеПриложения.Имя, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция УдалитьПриложениеИзСписка(СписокПриложений, ИмяПриложения)
	
	Результат = Новый Массив;
	
	Для каждого ОписаниеПриложения Из СписокПриложений Цикл
		Если ОписаниеПриложения.Имя <> ИмяПриложения Тогда
			Результат.Добавить(ОписаниеПриложения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДоступныеВозможностиПриложений(ОписаниеДоступныхПриложений, ЗамещаемыеПриложения = Неопределено)
	
	ДоступныеВозможностиПриложений = Новый Массив;
	Если ОписаниеДоступныхПриложений.Количество() = 0 Тогда
		Возврат ДоступныеВозможностиПриложений;
	КонецЕсли;
	
	Если ЗамещаемыеПриложения = Неопределено Тогда
		ЗамещаемыеПриложения = Новый Массив;
	КонецЕсли;
	
	Для каждого ОписаниеПриложения Из ОписаниеДоступныхПриложений Цикл
		
		Попытка
			
			Если ЗамещаемыеПриложения.Найти(ОписаниеПриложения.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			МодульПриложения = ОбщегоНазначения.ОбщийМодуль(ОписаниеПриложения.МодульПриложения);
			ДоступныеВозможностиПриложения = МодульПриложения.ФункциональныеВозможностиПриложения();
			МассивВозможностей = ДоступныеВозможностиПриложения.ВыгрузитьКолонку("Имя");
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДоступныеВозможностиПриложений, МассивВозможностей, Истина);
			
		Исключение
			
			Комментарий = НСтр("ru='Ошибка при попытке сформировать список доступных возможностей по причине:
			|%2.'");
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			Комментарий = СтрШаблон(Комментарий, ОписаниеПриложения.Имя, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
			
		КонецПопытки;
	КонецЦикла;
	
	Возврат ДоступныеВозможностиПриложений;
	
КонецФункции

Функция ЗамещаемыеПриложенияПодключенныхПриложений(ОписаниеДоступныхПриложений)
	
	ЗамещаемыеПриложения = Новый Массив;
	
	Для Каждого ОписаниеПриложения Из ОписаниеДоступныхПриложений Цикл
		Для Каждого Приложение Из ОписаниеПриложения.ЗамещаетПриложения Цикл
			Если ЗамещаемыеПриложения.Найти(Приложение) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗамещаемыеПриложения.Добавить(Приложение);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ЗамещаемыеПриложения;
	
КонецФункции

Функция ОписаниеВыбранныхПриложений(ОписаниеДоступныхПриложений, ВыбранныеПриложенияПодключаемогоПриложения)
	
	ВыбранныеПриложения = Новый Массив;
	
	Для Каждого Приложение Из ОписаниеДоступныхПриложений Цикл
		Если ВыбранныеПриложенияПодключаемогоПриложения.Найти(Приложение.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ВыбранныеПриложения.Добавить(Приложение);
	КонецЦикла;
	
	Возврат ВыбранныеПриложения;
	
КонецФункции

Процедура ОповеститьОПодключенномПриложении(ОписаниеПриложения)
	
	ОповеститьОПодключенииОтключенииПриложения(ОписаниеПриложения, Истина);
	
КонецПроцедуры

Процедура ОповеститьОбОтключенномПриложении(ОписаниеПриложения)
	
	ОповеститьОПодключенииОтключенииПриложения(ОписаниеПриложения, Ложь);
	
КонецПроцедуры

Процедура ОповеститьОПодключенииОтключенииПриложения(ОписаниеПриложения, ПриложениеБылоПодключено)
	
	ИмяОповещения = ТарификацияБизнесКлиентСервер.ИмяСерверногоОповещения();
	
	Данные = Новый Структура;
	Данные.Вставить("ОписаниеПриложения", ОписаниеПриложения);
	Данные.Вставить("ПриложениеБылоПодключено", ПриложениеБылоПодключено);
	
	СерверныеОповещения.ОтправитьСерверноеОповещение(ИмяОповещения, Данные, Неопределено, Истина);
	
КонецПроцедуры

#КонецОбласти

Функция НовыйОписаниеПриложения()
	
	ОписаниеПриложения = Новый Структура;
	ОписаниеПриложения.Вставить("Имя", "");
	ОписаниеПриложения.Вставить("Синоним", "");
	ОписаниеПриложения.Вставить("ИдентификаторУслугиСервиса", "");
	ОписаниеПриложения.Вставить("МодульПриложения", "");
	ОписаниеПриложения.Вставить("ЗамещаетПриложения", Новый Массив);
	ОписаниеПриложения.Вставить("СовместныеПриложения", Новый Массив);
	ОписаниеПриложения.Вставить("ЭтоБизнесПриложение", Ложь);
	Возврат ОписаниеПриложения;
	
КонецФункции

Функция ПодключенныеУслугиПриложений()
	
	ИдентификаторПоставщикаУНФ = ТарификацияУНФ.ИдентификаторПоставщикаУНФ();
	
	ВсеУслугиПриложений = СписокУслуг();
	Результат = Новый Массив;
	
	Для каждого ОписаниеУслуги Из ВсеУслугиПриложений Цикл
		Если Тарификация.ЗарегистрированаЛицензияБезлимитнойУслуги(ИдентификаторПоставщикаУНФ, ОписаниеУслуги.Идентификатор) Тогда
			Результат.Добавить(ОписаниеУслуги.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПриложенияПоИдентификаторамУслуг(ИдентификаторыУслуг)
	
	Если ТипЗнч(ИдентификаторыУслуг) <> Тип("Массив") Тогда
		ОтборИдентификаторыУслуг = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторыУслуг);
	Иначе
		ОтборИдентификаторыУслуг = ИдентификаторыУслуг;
	КонецЕсли;
	
	Результат = Новый Массив;
	ОписаниеПриложений = ОписаниеВсехПриложений();
	
	Для каждого ОписаниеПриложения Из ОписаниеПриложений Цикл
		Если ОтборИдентификаторыУслуг.Найти(ОписаниеПриложения.ИдентификаторУслугиСервиса) <> Неопределено Тогда
			Результат.Добавить(ОписаниеПриложения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПриложениеЗамещено(
	ОписаниеПриложения, ОписаниеВсехПриложений = Неопределено, ОписаниеПриложенийДляПроверки = Неопределено)
	
	Если ОписаниеВсехПриложений = Неопределено Тогда
		ОписаниеВсехПриложений = ТарификацияБизнес.ОписаниеВсехПриложений();
	КонецЕсли;
	
	Если ОписаниеПриложенийДляПроверки = Неопределено Тогда
		ОписаниеПриложенийДляПроверки = РегистрыСведений.ПодключениеКомбинированныхПриложений.ПодключенныеПриложения();
	КонецЕсли;
	
	НовыеПриложенияДляПроверки = Новый Массив;
	Для Каждого Приложение Из ОписаниеПриложенийДляПроверки Цикл
		
		Для Каждого ЗамещаемоеПриложение Из Приложение.ЗамещаетПриложения Цикл
			
			Если ЗамещаемоеПриложение = ОписаниеПриложения.Имя Тогда
				Возврат Истина;
			КонецЕсли;
			
			ОписаниеПриложенияДляПроверки = ОписаниеПриложенияПоИмени(ЗамещаемоеПриложение, ОписаниеВсехПриложений);
			НовыеПриложенияДляПроверки.Добавить(ОписаниеПриложенияДляПроверки);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если НовыеПриложенияДляПроверки.Количество() Тогда
		Возврат ЭтоПриложениеЗамещено(ОписаниеПриложения, ОписаниеВсехПриложений, НовыеПриложенияДляПроверки);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ОписаниеПриложенияПоИмени(Имя, ОписаниеВсехПриложений)
	
	Для Каждого Описание Из ОписаниеВсехПриложений Цикл
		Если Описание.Имя = Имя Тогда
			Возврат Описание;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Процедура ПолучитьВерхнеуровневоеПриложение(ОписаниеЗамещаемыхПриложений)
	
	МассивВложенныхПриложений = Новый Массив;
	Для Каждого Приложение Из ОписаниеЗамещаемыхПриложений Цикл     
		Для Каждого ЗамещаемоеПриложение Из Приложение.ЗамещаетПриложения Цикл
			МассивВложенныхПриложений.Добавить(ЗамещаемоеПриложение);	
		КонецЦикла;
	КонецЦикла; 
	ИтоговоеОписаниеПриложений = Новый Массив;
	Для Каждого ОписаниеПриложения Из ОписаниеЗамещаемыхПриложений Цикл
		Если МассивВложенныхПриложений.Найти(ОписаниеПриложения.Имя) = Неопределено Тогда
			ИтоговоеОписаниеПриложений.Добавить(ОписаниеПриложения); 	
		КонецЕсли;
	КонецЦикла;    
	
	ОписаниеЗамещаемыхПриложений = ИтоговоеОписаниеПриложений;
	
КонецПроцедуры

Функция ЗарегистрированаАльтернативнаяЛицензияБезлимитнойУслуги(ИдентификаторПоставщика,
		ИдентификаторУслуги, НомерИсключаемойПодписки)

	// Если услуга не найдена, тогда возвращается ЛОЖЬ.
	Услуга = Тарификация.УслугаПоИдентификаторуИИдентификаторуПоставщика(
		ИдентификаторУслуги, ИдентификаторПоставщика, Ложь); // СправочникСсылка.УслугиСервиса
		
	Если Услуга = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	// Если услуга не тарифицируется, тогда возвращается ИСТИНА.
	УслугаТарифицируется = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Услуга, "Тарифицируется");
	Если Не УслугаТарифицируется Тогда
		Возврат Истина;
	КонецЕсли;

	// Если есть подписка на услугу, тогда возвращается ИСТИНА, иначе - ЛОЖЬ.
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоступныеЛицензии.ИдентификаторПодписки КАК ИдентификаторПодписки
	|ИЗ
	|	РегистрСведений.ДоступныеЛицензии КАК ДоступныеЛицензии
	|ГДЕ
	|	ДоступныеЛицензии.Услуга = &Услуга
	|	И &ДатаЗапроса МЕЖДУ ДоступныеЛицензии.ДатаНачалаДействия И ДоступныеЛицензии.ДатаОкончанияДействия
	|	И ДоступныеЛицензии.НомерПодписки <> &НомерИсключаемойПодписки");
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("ДатаЗапроса", ТекущаяУниверсальнаяДата());
	Запрос.УстановитьПараметр("НомерИсключаемойПодписки", НомерИсключаемойПодписки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

#Область РегламентноеЗадание   

Процедура АктуализацияСостоянийПодключенныхПодписок() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.АктуализацияСостоянийПодключенныхПодписок);
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.АктуализацияСостоянийПодключенныхПодписок;
	
	АктуализироватьСостояниеПодписок();
	
КонецПроцедуры  

Процедура АктуализироватьСостояниеПодписок() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);  
	ДоступныеПриложения = ТарификацияБизнес.ОписаниеВсехПриложений();
	
	ТаблицаВсеПриложения = Новый ТаблицаЗначений;
	ТаблицаВсеПриложения.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255)));
	ТаблицаВсеПриложения.Колонки.Добавить("ИдентификаторУслугиСервиса", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(255)));   
	Для Каждого ОписаниеПриложения Из ДоступныеПриложения Цикл
		СтрокаПриложения = ТаблицаВсеПриложения.Добавить();
    	ЗаполнитьЗначенияСвойств(СтрокаПриложения, ОписаниеПриложения);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	втОписаниеПриложений.Имя КАК Имя,
		|	втОписаниеПриложений.ИдентификаторУслугиСервиса КАК ИдентификаторУслугиСервиса
		|ПОМЕСТИТЬ втОписаниеВсехПриложения
		|ИЗ
		|	&втОписаниеПриложений КАК втОписаниеПриложений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОписаниеВсехПриложения.Имя КАК Имя,
		|	ДоступныеЛицензии.ИдентификаторПодписки КАК ИдентификаторПодписки,
		|	ДоступныеЛицензии.Услуга КАК Услуга,
		|	&ТекДата >= ДоступныеЛицензии.ДатаНачалаДействия
		|		И &ТекДата <= ДоступныеЛицензии.ДатаОкончанияДействия КАК ПодпискаАктуальнаПоРегистру,
		|	ДоступныеЛицензии.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ДоступныеЛицензии.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ДоступныеЛицензии.НомерПодписки КАК НомерПодписки
		|ПОМЕСТИТЬ втДоступныеЛицензииСИменами
		|ИЗ
		|	РегистрСведений.ДоступныеЛицензии КАК ДоступныеЛицензии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиСервиса КАК УслугиСервиса
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОписаниеВсехПриложения КАК втОписаниеВсехПриложения
		|			ПО УслугиСервиса.Идентификатор = втОписаниеВсехПриложения.ИдентификаторУслугиСервиса
		|		ПО ДоступныеЛицензии.Услуга = УслугиСервиса.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДоступныеЛицензииСИменами.Услуга КАК Услуга,
		|	втДоступныеЛицензииСИменами.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	втДоступныеЛицензииСИменами.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	втДоступныеЛицензииСИменами.НомерПодписки КАК НомерПодписки,
		|	втДоступныеЛицензииСИменами.ПодпискаАктуальнаПоРегистру КАК ПодпискаАктуальнаПоРегистру
		|ИЗ
		|	РегистрСведений.ПодключениеКомбинированныхПриложений.СрезПоследних КАК ПодключениеКомбинированныхПриложенийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоступныеЛицензииСИменами КАК втДоступныеЛицензииСИменами
		|		ПО ПодключениеКомбинированныхПриложенийСрезПоследних.ИмяПриложения = втДоступныеЛицензииСИменами.Имя,
		|	втОписаниеВсехПриложения КАК втОписаниеВсехПриложения
		|ГДЕ
		|	ПодключениеКомбинированныхПриложенийСрезПоследних.Статус = &СтатусПодключено
		|	И втДоступныеЛицензииСИменами.ПодпискаАктуальнаПоРегистру = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УслугиСервиса.Ссылка,
		|	ДОБАВИТЬКДАТЕ(&ТекДата, НЕДЕЛЯ, 1),
		|	ДОБАВИТЬКДАТЕ(&ТекДата, НЕДЕЛЯ, 2),
		|	""НомерУдален"",
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.ПодключениеКомбинированныхПриложений.СрезПоследних КАК ПодключениеКомбинированныхПриложенийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ втДоступныеЛицензииСИменами КАК втДоступныеЛицензииСИменами
		|		ПО ПодключениеКомбинированныхПриложенийСрезПоследних.ИмяПриложения = втДоступныеЛицензииСИменами.Имя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОписаниеВсехПриложения КАК втОписаниеВсехПриложения
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиСервиса КАК УслугиСервиса
		|			ПО втОписаниеВсехПриложения.ИдентификаторУслугиСервиса = УслугиСервиса.Идентификатор
		|		ПО ПодключениеКомбинированныхПриложенийСрезПоследних.ИмяПриложения = втОписаниеВсехПриложения.Имя
		|ГДЕ
		|	втДоступныеЛицензииСИменами.Услуга ЕСТЬ NULL
		|	И ПодключениеКомбинированныхПриложенийСрезПоследних.Статус = &СтатусПодключено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втДоступныеЛицензииСИменами.Услуга,
		|	втДоступныеЛицензииСИменами.ДатаНачалаДействия,
		|	втДоступныеЛицензииСИменами.ДатаОкончанияДействия,
		|	втДоступныеЛицензииСИменами.НомерПодписки,
		|	втДоступныеЛицензииСИменами.ПодпискаАктуальнаПоРегистру
		|ИЗ
		|	втДоступныеЛицензииСИменами КАК втДоступныеЛицензииСИменами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодключениеКомбинированныхПриложений.СрезПоследних КАК ПодключениеКомбинированныхПриложенийСрезПоследних
		|		ПО втДоступныеЛицензииСИменами.Имя = ПодключениеКомбинированныхПриложенийСрезПоследних.ИмяПриложения
		|ГДЕ
		|	втДоступныеЛицензииСИменами.ПодпискаАктуальнаПоРегистру = ИСТИНА
		|	И ПодключениеКомбинированныхПриложенийСрезПоследних.Статус <> &СтатусПодключено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втДоступныеЛицензииСИменами.Услуга,
		|	втДоступныеЛицензииСИменами.ДатаНачалаДействия,
		|	втДоступныеЛицензииСИменами.ДатаОкончанияДействия,
		|	втДоступныеЛицензииСИменами.НомерПодписки,
		|	втДоступныеЛицензииСИменами.ПодпискаАктуальнаПоРегистру
		|ИЗ
		|	втДоступныеЛицензииСИменами КАК втДоступныеЛицензииСИменами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодключениеКомбинированныхПриложений.СрезПоследних КАК ПодключениеКомбинированныхПриложенийСрезПоследних
		|		ПО втДоступныеЛицензииСИменами.Имя = ПодключениеКомбинированныхПриложенийСрезПоследних.ИмяПриложения
		|ГДЕ
		|	втДоступныеЛицензииСИменами.ПодпискаАктуальнаПоРегистру = ИСТИНА
		|	И ПодключениеКомбинированныхПриложенийСрезПоследних.Статус ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ТекДата",ТекущаяУниверсальнаяДата());
	Запрос.УстановитьПараметр("СтатусПодключено", Перечисления.СтатусКомбинированногоПриложения.Подключено);
	Запрос.УстановитьПараметр("втОписаниеПриложений", ТаблицаВсеПриложения);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПараметрыЛицензии = Новый Структура;
		ПараметрыЛицензии.Вставить("Услуга", Выборка.Услуга);
		ПараметрыЛицензии.Вставить("ДатаНачалаДействия", Выборка.ДатаНачалаДействия);
		ПараметрыЛицензии.Вставить("ДатаОкончанияДействия", Выборка.ДатаОкончанияДействия);
		ПараметрыЛицензии.Вставить("НомерПодписки", Выборка.НомерПодписки);
       	ПриУдаленииДоступныхЛицензий(ПараметрыЛицензии);
		Если Выборка.ПодпискаАктуальнаПоРегистру = Истина Тогда
       		ПриОбновленииДоступныхЛицензий(ПараметрыЛицензии);
		КонецЕсли;
	КонецЦикла;        
	
	УстановитьПривилегированныйРежим(Ложь);  
	
КонецПроцедуры	

Процедура ВключитьРегламентноеЗаданиеАктуализацияСостоянийПодключенныхПодписок()
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.АктуализацияСостоянийПодключенныхПодписок;
	Задание = РегламентныеЗаданияСервер.Задание(РегламентноеЗадание);
	Если Задание = Неопределено Тогда
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Метаданные", РегламентноеЗадание);
		ПараметрыЗадания.Вставить("Использование", Истина);
		ПараметрыЗадания.Вставить("Расписание", РасписаниеРегламентногоЗаданияАктуализацияСостоянийПодключенныхПодписок());
		ПараметрыЗадания.Вставить("ИнтервалПовтораПриАварийномЗавершении", ?(ОбщегоНазначения.РежимОтладки(), 20, 3600));
		ПараметрыЗадания.Вставить("КоличествоПовторовПриАварийномЗавершении", 3);  
		Если ЗначениеЗаполнено(РегламентноеЗадание.Ключ) Тогда
			ПараметрыЗадания.Вставить("Ключ", РегламентноеЗадание.Ключ);
		КонецЕсли;		
		РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	КонецЕсли;

КонецПроцедуры
 
Функция РасписаниеРегламентногоЗаданияАктуализацияСостоянийПодключенныхПодписок()
	
	Месяцы = Новый Массив;
	Месяцы.Добавить(1);
	Месяцы.Добавить(2);
	Месяцы.Добавить(3);
	Месяцы.Добавить(4);
	Месяцы.Добавить(5);
	Месяцы.Добавить(6);
	Месяцы.Добавить(7);
	Месяцы.Добавить(8);
	Месяцы.Добавить(9);
	Месяцы.Добавить(10);
	Месяцы.Добавить(11);
	Месяцы.Добавить(12);
	
	ДниНедели = Новый Массив;
	ДниНедели.Добавить(1);
	ДниНедели.Добавить(2);
	ДниНедели.Добавить(3);
	ДниНедели.Добавить(4);
	ДниНедели.Добавить(5);
	ДниНедели.Добавить(6);
	ДниНедели.Добавить(7);
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ДниНедели   = ДниНедели;
	Расписание.Месяцы      = Месяцы;
	Расписание.ПериодПовтораВТечениеДня = 3600 * 12;
	Расписание.ПериодПовтораДней        = 1; // Каждый день.
	
	Возврат Расписание;
	
КонецФункции

#КонецОбласти  

#КонецОбласти
